using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace _01___4_SumAvg
{
    class Program
    {
        static void Main(string[] args)
        {
            //Максимален брой стъпки (сложност) е: 6n + 13 (n е броя въведени числа)

            List<int> numbers = Console.ReadLine()  // +1 стъпка (за четене от конзолата)
                               .Split(' ')         // +n стъпка (за всяко изважадане на елемент)
                               .Select(int.Parse)  // +n стъпка (за промяна на типа данни на всеки елемент)
                               .ToList();          // +1 стъпка (за "превръщане" на елементите в лист)

            int sum = 0; //+1 стъпка

            //не използвам foreach понеже имаме определено незнание за това точно как работи и какви и колко стъпки има в него
            for (int i = 0; i < numbers.Count; i++) //+2n + 2 стъпки (попринцип за всеки индекс ние ще увеличим i и ще сравним, освен първия път когато не добавяме 1 към i а декларираме i и накрая имаме +2 за последното сравнение (в този цикъл нямаме break); виж предишните задачи ако не разбираш) 
            {
                sum += numbers[i]; //+2 стъпки (1 за да извадим числото от листа и още 1 за да годобавим към sum)
            }//общо 4n + 2(самия цикъл ще се завърти 2n пъти и при всяко завъртане ще изпълнява 2 действия, товест 2 * 2n)

            double avg = sum * 1.0 / numbers.Count; //+4 стъпки (1 за умножение с 1.0 (правене int на double), 1 за изваждане на numbers.Count, 1 за делене и 1 за слагане на стойността да е avg)

            Console.WriteLine($"Sum={sum}; Average={avg:F2}"); //+4 стъпки (1 за добавяне на sum в string, 1 за закръгляне на avg, 1 за добавяне на закръгленото avg към string и 1 за изписване на string)
        }
    }
}
